## Import Libraries

In [1]:
import pandas as pd
import numpy as np

## Creating dataframe

In [2]:
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'],
        'age': [42, np.nan, 36, 24, 73],
        'sex': ['m', np.nan, 'f', 'm', 'f'],
        'preTestScore': [4, np.nan, np.nan, 2, 3],
        'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age  sex  preTestScore  postTestScore
0      Jason    Miller   42    m             4             25
1        NaN       NaN  NaN  NaN           NaN            NaN
2       Tina       Ali   36    f           NaN            NaN
3       Jake    Milner   24    m             2             62
4        Amy     Cooze   73    f             3             70

## Dropping Missing Value

In [4]:
df_no_missing = df.dropna()
df_no_missing

  first_name last_name  age sex  preTestScore  postTestScore
0      Jason    Miller   42   m             4             25
3       Jake    Milner   24   m             2             62
4        Amy     Cooze   73   f             3             70

## Drop rows where all record is nan

In [5]:
df_cleaned = df.dropna(how='all')
df_cleaned

  first_name last_name  age sex  preTestScore  postTestScore
0      Jason    Miller   42   m             4             25
2       Tina       Ali   36   f           NaN            NaN
3       Jake    Milner   24   m             2             62
4        Amy     Cooze   73   f             3             70

## Creating new column full of missing values

In [6]:
df['location'] = np.nan
df

  first_name last_name  age  sex  preTestScore  postTestScore  location
0      Jason    Miller   42    m             4             25       NaN
1        NaN       NaN  NaN  NaN           NaN            NaN       NaN
2       Tina       Ali   36    f           NaN            NaN       NaN
3       Jake    Milner   24    m             2             62       NaN
4        Amy     Cooze   73    f             3             70       NaN

## Drop column if they only contain missing values

In [7]:
df.dropna(axis=1, how='all')

  first_name last_name  age  sex  preTestScore  postTestScore
0      Jason    Miller   42    m             4             25
1        NaN       NaN  NaN  NaN           NaN            NaN
2       Tina       Ali   36    f           NaN            NaN
3       Jake    Milner   24    m             2             62
4        Amy     Cooze   73    f             3             70

## Drop rows that contain less than five observations

In [8]:
df.dropna(thresh=5)

  first_name last_name  age sex  preTestScore  postTestScore  location
0      Jason    Miller   42   m             4             25       NaN
3       Jake    Milner   24   m             2             62       NaN
4        Amy     Cooze   73   f             3             70       NaN

## Fill in missing data with zeros

In [9]:
df.fillna(0)

  first_name last_name  age sex  preTestScore  postTestScore  location
0      Jason    Miller   42   m             4             25         0
1          0         0    0   0             0              0         0
2       Tina       Ali   36   f             0              0         0
3       Jake    Milner   24   m             2             62         0
4        Amy     Cooze   73   f             3             70         0

## Fill in missing in preTestScore with the mean value of preTestScore

In [10]:
## inplace=True means that the changes are saved to the df right away

df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
df

  first_name last_name  age  sex  preTestScore  postTestScore  location
0      Jason    Miller   42    m             4             25       NaN
1        NaN       NaN  NaN  NaN             3            NaN       NaN
2       Tina       Ali   36    f             3            NaN       NaN
3       Jake    Milner   24    m             2             62       NaN
4        Amy     Cooze   73    f             3             70       NaN

## Fill in missing in postTestScore with each sex's mean value of postTestScore

In [11]:
df["postTestScore"].fillna(df.groupby("sex")["postTestScore"].transform("mean"), inplace=True)
df

  first_name last_name  age  sex  preTestScore  postTestScore  location
0      Jason    Miller   42    m             4             25       NaN
1        NaN       NaN  NaN  NaN             3            NaN       NaN
2       Tina       Ali   36    f             3             70       NaN
3       Jake    Milner   24    m             2             62       NaN
4        Amy     Cooze   73    f             3             70       NaN

## Select some raws but ignore the missing data points

In [ ]:
# Select the rows of df where age is not NaN and sex is not NaN
df[df['age'].notnull() & df['sex'].notnull()]